<a href="https://colab.research.google.com/github/JimmyCarrasco/Curso_Python/blob/main/modulo_2/4_Pandas_Dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src="https://www.ctic.uni.edu.pe/wp-content/uploads/2022/04/588px-x-348px-web-1.png" alt="HTML5 Icon" width="900" height="350" >

<h1 align=center><font size = 5> ESTRUCTURAS DE DATOS - PANDAS DATAFRAMES
</font></h1>

---

## Tabla de Contenidos

<div class="alert alert-block alert-info" style="margin-top: 20px">

<font size = 3>

1. <a href="#item31">Series en Pandas</a>
2. <a href="#item32">DataFrames en Pandas</a>
3. <a href="#item33">Indexación y selección de datos en DataFrames</a>
4. <a href="#item34">Limpieza y manipulación de datos</a>

</font>
</div>

---

## 1. Series en Pandas

* Es una estructura de datos unidimensional que puede contener datos de cualquier tipo (enteros, flotantes, cadenas, etc.). Es similar a una columna en una tabla o una matriz unidimensional, y se utiliza para representar y manipular conjuntos de datos unidimensionales.

* Una Serie consta de dos componentes principales: los datos y el índice. Los datos representan los valores almacenados en la Serie, mientras que el índice es una etiqueta asociada a cada elemento de los datos que permite identificar y acceder a ellos de manera eficiente.

### Creación de Series

Crear una Serie a partir de una lista:

In [1]:
import pandas as pd

datos = [10, 20, 30, 40, 50]
serie = pd.Series(datos)
print(serie)

0    10
1    20
2    30
3    40
4    50
dtype: int64

Crear una Serie a partir de un diccionario:

In [2]:
datos = {'a': 10, 'b': 20, 'c': 30, 'd': 40, 'e': 50}
serie = pd.Series(datos)
print(serie)

a    10
b    20
c    30
d    40
e    50
dtype: int64

Crear una Serie con etiquetas personalizadas:

In [3]:
datos = [10, 20, 30, 40, 50]
etiquetas = ['A', 'B', 'C', 'D', 'E']

serie = pd.Series(datos, index=etiquetas)
print(serie)

A    10
B    20
C    30
D    40
E    50
dtype: int64

Crear una Serie a partir de un arreglo de NumPy:

In [4]:
import numpy as np

arreglo = np.array([10, 20, 30, 40, 50])
serie = pd.Series(arreglo)
print(serie)

0    10
1    20
2    30
3    40
4    50
dtype: int64

<b> Ejercicio 1 </b>

Crear una Serie con los siguientes datos y mostrarla por pantalla:

* Datos: [25, 10, 15, 30, 20]
* Índices: ['A', 'B', 'C', 'D', 'E']


<b> Ejercicio 2 </b>

Crear una Serie con nombres de ciudades como índices y sus respectivas poblaciones como datos.

### Indexación y selección de datos

In [5]:
import pandas as pd

datos = [10, 20, 30, 40, 50]
etiquetas = ['A', 'B', 'C', 'D', 'E']
serie = pd.Series(datos, index = etiquetas)
print(serie)

A    10
B    20
C    30
D    40
E    50
dtype: int64

Acceder a un elemento específico utilizando una etiqueta:

In [6]:
print(serie['B'])

20

Acceder a varios elementos utilizando una lista de etiquetas:

In [7]:
print(serie[['A', 'C', 'E']])

A    10
C    30
E    50
dtype: int64

Acceder a elementos utilizando indexación basada en posición:

In [8]:
print(serie[1])  # Acceder al segundo elemento
print(serie[1:4])  # Acceder a un rango de elementos (exclusivo)

20
B    20
C    30
D    40
dtype: int64

Acceder a elementos utilizando una condición:

In [9]:
print(serie[serie > 30])

D    40
E    50
dtype: int64

<b> Ejercicio 1 </b>

Crear una Serie con nombres de ciudades como índices y sus respectivas poblaciones como datos. Luego, seleccionar las ciudades con población superior a 1 millón.

<b> Ejercicio 2 </b>

Sobre el mismo ejercicio extraiga el registro de dos ciudades específicas (usted decida cuáles).

### Operaciones básicas con Series

In [10]:
import pandas as pd

serie1 = pd.Series([10, 20, 30, 40, 50])
serie2 = pd.Series([5, 15, 25, 35, 45])

Sumar dos Series:

In [11]:
suma = serie1 + serie2
print(suma)

0    15
1    35
2    55
3    75
4    95
dtype: int64

Restar dos Series:

In [12]:
resta = serie1 - serie2
print(resta)

0    5
1    5
2    5
3    5
4    5
dtype: int64

Multiplicar una Serie por un escalar:

In [13]:
multiplicacion = serie1 * 2
print(multiplicacion)

0     20
1     40
2     60
3     80
4    100
dtype: int64

Dividir una Serie por otra:

In [14]:
division = serie1 / serie2
print(division)

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

Calcular el cuadrado de una Serie:

In [15]:
cuadrado = serie1 ** 2
print(cuadrado)

0     100
1     400
2     900
3    1600
4    2500
dtype: int64

Calcular la raíz cuadrada de una Serie:

In [16]:
import numpy as np

raiz_cuadrada = np.sqrt(serie1)
print(raiz_cuadrada)

0    3.162278
1    4.472136
2    5.477226
3    6.324555
4    7.071068
dtype: float64

Operaciones de tipo str

In [17]:
datos = ['John', 'Luis', 'Pablo', 'Cesar']
serie = pd.Series(datos)
serie = serie.str.lower()

print(serie)

0     john
1     luis
2    pablo
3    cesar
dtype: object

In [18]:
datos = ['john', 'luis', 'pablo', 'cesar']
serie = pd.Series(datos)
serie = serie.str.upper()

print(serie)

0     JOHN
1     LUIS
2    PABLO
3    CESAR
dtype: object

In [19]:
datos = ['john', 'luis', 'pablo', 'cesar']
serie = pd.Series(datos)
serie = serie.str.capitalize()

print(serie)

0     John
1     Luis
2    Pablo
3    Cesar
dtype: object

Algunas operaciones estadísticas

In [20]:

datos = [2, 4, 2, 5, 1, 3]
serie = pd.Series(datos)

media = serie.mean()
desviacion_estandar = serie.std()

print("Media:", media)
print("Desviación estándar:", desviacion_estandar)

Media: 2.8333333333333335
Desviación estándar: 1.4719601443879746

**Ejercicio 1**

Crear una Serie con números enteros del 1 al 10 como índices y sus respectivos cuadrados como datos.

**Ejercicio 2**

Crear dos Series con los siguientes datos y luego sumarlas.

> Serie 1: [10, 20, 30, 40, 50]
>
> Serie 2: [5, 15, 25, 35, 45]

**Ejercicio 3**

Crear una Serie a partir de una lista de cadenas y convertir todas las letras a minúsculas.

Datos: ['Manzana', 'Banana', 'Naranja', 'Pera']

**Ejercicio 4**

Crear una Serie con los siguientes datos y calcular la media y la desviación estándar.

Datos: [15, 22, 18, 25, 20]

**Ejercicio 5**

Crear una Serie a partir de una lista y reemplazar un valor específico por otro.

Datos: [5, 10, 15, 20, 25]
Reemplazar el valor 15 por 30.

**Ejercicio 6**

Crear una Serie con los siguientes datos y mostrar los valores únicos.

Datos: ['manzana', 'pera', 'manzana', 'plátano', 'manzana', 'pera']

## 2. DataFrames en Pandas

* Es una estructura de datos bidimensional que se utiliza para almacenar y manipular datos.
* Se puede pensar en un DataFrame como una tabla en una base de datos o una hoja de cálculo en Excel.
* Está compuesto por filas y columnas, donde cada columna puede contener datos de un tipo diferente (enteros, flotantes, cadenas, etc.).

Un DataFrame en Pandas se puede crear de varias formas, pero comúnmente se utiliza para almacenar datos provenientes de archivos CSV, bases de datos o mediante la combinación de otras estructuras de datos, como Series.

### 2.1. Creación de DataFrames

Desde un diccionario de Python

In [21]:
import pandas as pd

data = {'Nombre': ['Juan', 'María', 'Pedro'],
        'Edad': [25, 30, 35],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia']}

df = pd.DataFrame(data)

print(df)

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia

Desde una lista de listas

In [22]:
import pandas as pd

data = [['Juan', 25, 'Madrid'],
        ['María', 30, 'Barcelona'],
        ['Pedro', 35, 'Valencia']]

df = pd.DataFrame(data, columns=['Nombre', 'Edad', 'Ciudad'])

print(df)

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35   Valencia

### 2.2. Carga de datos desde diferentes fuentes (CSV, Excel, SQL, etc.)

Desde un archivo CSV

In [24]:
from google.colab import drive
drive.mount('/content/drive', force_remount=True)

Mounted at /content/drive

In [25]:
cd /content/drive/MyDrive/UTEC_CURSO_PYTHON/MODULO2

/content/drive/MyDrive/UTEC_CURSO_PYTHON/MODULO2

In [26]:
import pandas as pd

df = pd.read_csv('train_titanic.csv')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Desde un txt

In [29]:
import pandas as pd

df = pd.read_csv('train_titanic.txt', delimiter = '\t')
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S

Desde un archivo Excel

In [33]:
import pandas as pd

# Leer el archivo de Excel en un DataFrame
df = pd.read_excel('train_titanic.xls')

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Desde formato parquet

In [34]:
import pandas as pd

# Leer el archivo Parquet en un DataFrame
df = pd.read_parquet('train_titanic.parquet')

# Imprimir el DataFrame
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [35]:
# Escribir un archivo en formato parquet
df.to_parquet('train_titanic.parquet')

Desde SQL

In [36]:
import pandas as pd
import sqlite3

# Establecer la conexión con la base de datos
conn = sqlite3.connect('titanic_train.db')

# Consulta SQL
query = 'SELECT * FROM titanic_train'

# Leer los datos desde la base de datos en un DataFrame
df = pd.read_sql(query, conn)

# Cerrar la conexión con la base de datos
conn.close()

# Imprimir el DataFrame
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [37]:

import sqlite3

# Establecer la conexión con la base de datos
conn = sqlite3.connect('titanic_train.db')

# Escribir el DataFrame en un archivo Parquet
df.to_sql('titanic_train', conn, if_exists='replace', index=False)

891

Conectar Google Drive a Google Colab

In [38]:
# Importar la biblioteca google.colab:
from google.colab import drive

In [39]:
# Montar Google Drive en entorno de Colab
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [41]:
import pandas as pd

ruta_archivo = '/content/drive/MyDrive/UTEC_CURSO_PYTHON/MODULO2/train_titanic.csv'
df = pd.read_csv(ruta_archivo)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
# Guardar un archivo en drive
df.to_csv('/content/drive/MyDrive/UTEC_CURSO_PYTHON/MODULO2/train_prueba_generado.csv')

### 2.3. Exploración y manipulación de DataFrames

In [45]:
pddf = pd.read_csv('/content/sample_data/california_housing_test.csv')
pddf.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0

#### Selección de columnas

In [51]:
pddf.total_rooms

0       3885.0
1       1510.0
2       3589.0
3         67.0
4       1241.0
         ...
2995    1450.0
2996    5257.0
2997     956.0
2998      96.0
2999    1765.0
Name: total_rooms, Length: 3000, dtype: float64

Notación de corchetes

In [52]:
pddf[['total_rooms']]  # Selecciona una columna o serie

      total_rooms
0          3885.0
1          1510.0
2          3589.0
3            67.0
4          1241.0
...           ...
2995       1450.0
2996       5257.0
2997        956.0
2998         96.0
2999       1765.0

[3000 rows x 1 columns]

In [49]:
pddf[['total_rooms', 'population']]  # Selecciona varias columnas

      total_rooms  population
0          3885.0      1537.0
1          1510.0       809.0
2          3589.0      1484.0
3            67.0        49.0
4          1241.0       850.0
...           ...         ...
2995       1450.0      1258.0
2996       5257.0      3496.0
2997        956.0       693.0
2998         96.0        46.0
2999       1765.0       753.0

[3000 rows x 2 columns]

Método loc[]

In [57]:
pddf.loc[:, :] ## [# de fila o filas , # de columna o columnas ]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23.0,1450.0,642.0,1258.0,607.0,1.1790,225000.0
2996,-118.14,34.06,27.0,5257.0,1082.0,3496.0,1036.0,3.3906,237200.0
2997,-119.70,36.30,10.0,956.0,201.0,693.0,220.0,2.2895,62000.0
2998,-117.12,34.10,40.0,96.0,14.0,46.0,14.0,3.2708,162500.0
2999,-119.63,34.42,42.0,1765.0,263.0,753.0,260.0,8.5608,500001.0

In [67]:
pddf.loc[0:1,:]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0

In [53]:
pddf.loc[:, 'total_rooms']  # Selecciona los elementos de una columna

0       3885.0
1       1510.0
2       3589.0
3         67.0
4       1241.0
         ...
2995    1450.0
2996    5257.0
2997     956.0
2998      96.0
2999    1765.0
Name: total_rooms, Length: 3000, dtype: float64

In [54]:
pddf.loc[:, ['total_rooms', 'population']]  # Selecciona varias columnas

      total_rooms  population
0          3885.0      1537.0
1          1510.0       809.0
2          3589.0      1484.0
3            67.0        49.0
4          1241.0       850.0
...           ...         ...
2995       1450.0      1258.0
2996       5257.0      3496.0
2997        956.0       693.0
2998         96.0        46.0
2999       1765.0       753.0

[3000 rows x 2 columns]

In [70]:
pddf.loc[pddf.population > 10000]  ## condicional para localizar

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
978,-121.53,38.48,5.0,27870.0,5027.0,11935.0,4855.0,4.8811,212200.0
1146,-117.27,33.15,4.0,23915.0,4135.0,10877.0,3958.0,4.6357,244900.0
2186,-116.14,34.45,12.0,8796.0,1721.0,11139.0,1680.0,2.2612,137500.0

Método iloc[]

In [68]:
pddf.iloc[:, :]  # Selecciona una columna por su índice, 0 es longitud en el df inicial

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23.0,1450.0,642.0,1258.0,607.0,1.1790,225000.0
2996,-118.14,34.06,27.0,5257.0,1082.0,3496.0,1036.0,3.3906,237200.0
2997,-119.70,36.30,10.0,956.0,201.0,693.0,220.0,2.2895,62000.0
2998,-117.12,34.10,40.0,96.0,14.0,46.0,14.0,3.2708,162500.0
2999,-119.63,34.42,42.0,1765.0,263.0,753.0,260.0,8.5608,500001.0

In [ ]:
pddf.iloc[:, [0, 1]]  # Selecciona varias columnas por sus índices

#### Creación de nuevas columnas

Funciones aplicadas a columnas

In [ ]:
import numpy as np

pddf['nueva_columna'] = np.sqrt(pddf['total_rooms'])

Condicionales y funciones lambda

In [ ]:
pddf['nueva_columna'] = pddf['total_rooms'].apply(lambda x: 'Mayor' if x > 10 else 'Menor')
pddf.head()

Asignación de un valor constante

In [ ]:
pddf['nueva_columna'] = 1

## 3. Indexación y selección de datos en DataFrames

### 3.1 Filtrado de filas

Operadores de comparación

In [ ]:
filtro = pddf['housing_median_age'] > 30
df_filtrado = pddf[filtro]
df_filtrado.head()

Operador isin()

In [ ]:
df = pd.read_csv('train_titanic.csv')
df.head()

In [ ]:
filtro = df['Sex'].isin(['male'])
df_filtrado = df[filtro]
df_filtrado.head()

Operador between()

In [ ]:
filtro = df['Age'].between(20, 30)
df_filtrado = df[filtro]
df_filtrado.head()

Método query()

In [ ]:
df_filtrado = df.query("Age > 30 and Sex == 'male'")
df_filtrado.head()

### 3.2. Agrupación y agregación

Operación de agregación

In [ ]:
df['Age'].mean()

In [ ]:
df.groupby('Sex')['Age'].mean()

## 4. Limpieza de datos

### 4.1. Ordenación

In [ ]:
df_sorted = df.sort_values(by='Age')
df_sorted.head()

In [ ]:
df_sorted = df.sort_values(by='Age', ascending = False)
df_sorted.head()

In [ ]:
df.sort_values(by='Age', ascending = False, inplace=True)
df.head()

### 4.2. Eliminación de duplicados:

In [ ]:
df2 = df[['Sex', 'Embarked']]
df2

In [ ]:
df_sin_duplicados = df2.drop_duplicates()
df_sin_duplicados

Eliminar filas duplicadas basándote en una columna específica:

In [ ]:
df_sin_duplicados = df2.drop_duplicates(subset='Embarked')
df_sin_duplicados

drop_duplicates() mantiene la primera aparición de una fila duplicada y elimina las siguientes. Sin embargo, puedes cambiar este comportamiento utilizando el argumento keep.

In [ ]:
df_sin_duplicados = df2.drop_duplicates(subset='Embarked', keep='first')
df_sin_duplicados

### 4.3. Manipulación de valores faltantes:

In [ ]:
df.isnull().sum()

In [ ]:
df.Age.fillna(df.Age.mean(), inplace = True)
df.isnull().sum()

## 5. Operaciones y transformaciones en DataFrames

### 5.1. Agregar y eliminar columnas

Agregar una columna

In [ ]:
df['nueva_columna'] = serie_o_lista

Eliminar una columna

In [ ]:
df = df.drop('nueva_columna', axis=1)

In [ ]:
del df['nueva_columna']

### 5.2. Operaciones aritméticas

In [ ]:
df['suma'] = df['SibSp'] + df['Parch']

In [ ]:
df.head()

### 5.3. Combinación de DataFrames

Concatenación

La concatenación se utiliza para combinar dos o más DataFrames a lo largo de un eje específico, ya sea por filas o por columnas. El resultado es un nuevo DataFrame que contiene todas las filas o columnas de los DataFrames originales.

los índices originales se conservan. Si deseas reindexar el DataFrame resultante, puedes utilizar el método reset_index() para restablecer el índice.

In [ ]:
import pandas as pd

# Creamos dos DataFrames de ejemplo
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': ['a', 'b', 'c']})

df2 = pd.DataFrame({'A': [4, 5, 6],
                    'B': ['d', 'e', 'f']})

# Concatenamos los DataFrames a lo largo del eje 0 (filas)
df_concatenado = pd.concat([df1, df2], axis=0)

df_concatenado

merge

In [ ]:
import pandas as pd

# Creamos dos DataFrames de ejemplo
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Nombre': ['Juan', 'María', 'Pedro']})

df2 = pd.DataFrame({'ID': [2, 3, 4],
                    'Edad': [25, 30, 35]})

# Realizamos la unión basándonos en la columna 'ID'
df_union = pd.merge(df1, df2, on='ID', how = 'inner')
df_union

## 6. Visualización de datos con Pandas

Visualización con Searborn

In [ ]:
import seaborn as sns

In [ ]:
# Gráfico de distribución
sns.displot(data=df, x='Age')

In [ ]:
# Gráfico de cajas
sns.boxplot(data=df, x='Age')

---

# Gracias por completar este laboratorio!

---